Masmiseim36/nxpSDK/devices/MIMXRT1182/periph/PERI_NETC_ETH_LINK.h
#define NETC_ETH_LINK_PM1_MINFRM_NUM_BYTES_MASK  (0x7FU)
#define NETC_ETH_LINK_PM1_MINFRM_NUM_BYTES_SHIFT (0U)
/*! NUM_BYTES - Receive Minimum Frame Length size in bytes. */
#define NETC_ETH_LINK_PM1_MINFRM_NUM_BYTES(x)    (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM1_MINFRM_NUM_BYTES_SHIFT)) & NETC_ETH_LINK_PM1_MINFRM_NUM_BYTES_MASK)
/*! @} */

/*! @name PM1_IEVENT - Port MAC 1 Interrupt Event Register */
/*! @{ */

#define NETC_ETH_LINK_PM1_IEVENT_TX_EMPTY_MASK   (0x20U)
#define NETC_ETH_LINK_PM1_IEVENT_TX_EMPTY_SHIFT  (5U)
/*! TX_EMPTY - Transmit fifo empty event */
#define NETC_ETH_LINK_PM1_IEVENT_TX_EMPTY(x)     (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM1_IEVENT_TX_EMPTY_SHIFT)) & NETC_ETH_LINK_PM1_IEVENT_TX_EMPTY_MASK)

#define NETC_ETH_LINK_PM1_IEVENT_RX_EMPTY_MASK   (0x40U)
#define NETC_ETH_LINK_PM1_IEVENT_RX_EMPTY_SHIFT  (6U)
/*! RX_EMPTY - Receive idle event */
#define NETC_ETH_LINK_PM1_IEVENT_RX_EMPTY(x)     (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM1_IEVENT_RX_EMPTY_SHIFT)) & NETC_ETH_LINK_PM1_IEVENT_RX_EMPTY_MASK)

#define NETC_ETH_LINK_PM1_IEVENT_TX_OVFL_MASK    (0x400U)
#define NETC_ETH_LINK_PM1_IEVENT_TX_OVFL_SHIFT   (10U)
/*! TX_OVFL - Transmit FIFO overflow event. */
#define NETC_ETH_LINK_PM1_IEVENT_TX_OVFL(x)      (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM1_IEVENT_TX_OVFL_SHIFT)) & NETC_ETH_LINK_PM1_IEVENT_TX_OVFL_MASK)

#define NETC_ETH_LINK_PM1_IEVENT_TX_UNFL_MASK    (0x800U)
#define NETC_ETH_LINK_PM1_IEVENT_TX_UNFL_SHIFT   (11U)
/*! TX_UNFL - Transmit FIFO underflow event. */
#define NETC_ETH_LINK_PM1_IEVENT_TX_UNFL(x)      (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM1_IEVENT_TX_UNFL_SHIFT)) & NETC_ETH_LINK_PM1_IEVENT_TX_UNFL_MASK)

#define NETC_ETH_LINK_PM1_IEVENT_RX_OVFL_MASK    (0x1000U)
#define NETC_ETH_LINK_PM1_IEVENT_RX_OVFL_SHIFT   (12U)
/*! RX_OVFL - Receive FIFO overflow event. */
#define NETC_ETH_LINK_PM1_IEVENT_RX_OVFL(x)      (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM1_IEVENT_RX_OVFL_SHIFT)) & NETC_ETH_LINK_PM1_IEVENT_RX_OVFL_MASK)

#define NETC_ETH_LINK_PM1_IEVENT_MGI_MASK        (0x4000U)
#define NETC_ETH_LINK_PM1_IEVENT_MGI_SHIFT       (14U)
/*! MGI - Magic packet detection indication event */
#define NETC_ETH_LINK_PM1_IEVENT_MGI(x)          (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM1_IEVENT_MGI_SHIFT)) & NETC_ETH_LINK_PM1_IEVENT_MGI_MASK)

#define NETC_ETH_LINK_PM1_IEVENT_TX_CSD_MASK     (0x200000U)
#define NETC_ETH_LINK_PM1_IEVENT_TX_CSD_SHIFT    (21U)
/*! TX_CSD - Tx Clock Stop Detection */
#define NETC_ETH_LINK_PM1_IEVENT_TX_CSD(x)       (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM1_IEVENT_TX_CSD_SHIFT)) & NETC_ETH_LINK_PM1_IEVENT_TX_CSD_MASK)

#define NETC_ETH_LINK_PM1_IEVENT_RX_CSD_MASK     (0x400000U)
#define NETC_ETH_LINK_PM1_IEVENT_RX_CSD_SHIFT    (22U)
/*! RX_CSD - Rx Clock Stop Detection */
#define NETC_ETH_LINK_PM1_IEVENT_RX_CSD(x)       (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM1_IEVENT_RX_CSD_SHIFT)) & NETC_ETH_LINK_PM1_IEVENT_RX_CSD_MASK)

#define NETC_ETH_LINK_PM1_IEVENT_SPD_DUP_MASK    (0x800000U)
#define NETC_ETH_LINK_PM1_IEVENT_SPD_DUP_SHIFT   (23U)
/*! SPD_DUP - Speed/Duplex Change */
#define NETC_ETH_LINK_PM1_IEVENT_SPD_DUP(x)      (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM1_IEVENT_SPD_DUP_SHIFT)) & NETC_ETH_LINK_PM1_IEVENT_SPD_DUP_MASK)

#define NETC_ETH_LINK_PM1_IEVENT_MRG_SERR_MASK   (0x8000000U)
#define NETC_ETH_LINK_PM1_IEVENT_MRG_SERR_SHIFT  (27U)
/*! MRG_SERR - MAC merge frame SMD error received event */
#define NETC_ETH_LINK_PM1_IEVENT_MRG_SERR(x)     (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM1_IEVENT_MRG_SERR_SHIFT)) & NETC_ETH_LINK_PM1_IEVENT_MRG_SERR_MASK)

#define NETC_ETH_LINK_PM1_IEVENT_MRG_AERR_MASK   (0x10000000U)
#define NETC_ETH_LINK_PM1_IEVENT_MRG_AERR_SHIFT  (28U)
/*! MRG_AERR - MAC merge frame assembly error event */
#define NETC_ETH_LINK_PM1_IEVENT_MRG_AERR(x)     (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM1_IEVENT_MRG_AERR_SHIFT)) & NETC_ETH_LINK_PM1_IEVENT_MRG_AERR_MASK)
/*! @} */

/*! @name PM1_TX_IPG_PREAMBLE - Port MAC 1 Transmit Inter-Packet Gap Length and Flexible Preamble length Register */
/*! @{ */

#define NETC_ETH_LINK_PM1_TX_IPG_PREAMBLE_IPG_LEN_MASK (0x7FU)
#define NETC_ETH_LINK_PM1_TX_IPG_PREAMBLE_IPG_LEN_SHIFT (0U)
/*! IPG_LEN - Transmit inter-packet gap value. */
#define NETC_ETH_LINK_PM1_TX_IPG_PREAMBLE_IPG_LEN(x) (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM1_TX_IPG_PREAMBLE_IPG_LEN_SHIFT)) & NETC_ETH_LINK_PM1_TX_IPG_PREAMBLE_IPG_LEN_MASK)

#define NETC_ETH_LINK_PM1_TX_IPG_PREAMBLE_FLEX_PREAMBLE_CNT_MASK (0x700U)
#define NETC_ETH_LINK_PM1_TX_IPG_PREAMBLE_FLEX_PREAMBLE_CNT_SHIFT (8U)
/*! FLEX_PREAMBLE_CNT - Flexible Preamble Count */
#define NETC_ETH_LINK_PM1_TX_IPG_PREAMBLE_FLEX_PREAMBLE_CNT(x) (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM1_TX_IPG_PREAMBLE_FLEX_PREAMBLE_CNT_SHIFT)) & NETC_ETH_LINK_PM1_TX_IPG_PREAMBLE_FLEX_PREAMBLE_CNT_MASK)

#define NETC_ETH_LINK_PM1_TX_IPG_PREAMBLE_FLEX_PREAMBLE_EN_MASK (0x80000000U)
#define NETC_ETH_LINK_PM1_TX_IPG_PREAMBLE_FLEX_PREAMBLE_EN_SHIFT (31U)
/*! FLEX_PREAMBLE_EN - Enable Flexible Preamble Count */
#define NETC_ETH_LINK_PM1_TX_IPG_PREAMBLE_FLEX_PREAMBLE_EN(x) (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM1_TX_IPG_PREAMBLE_FLEX_PREAMBLE_EN_SHIFT)) & NETC_ETH_LINK_PM1_TX_IPG_PREAMBLE_FLEX_PREAMBLE_EN_MASK)
/*! @} */

/*! @name PM1_IMASK - Port MAC 1 Interrupt Mask Register(INT_MASK) */
/*! @{ */

#define NETC_ETH_LINK_PM1_IMASK_MGI_MASK         (0x4000U)
#define NETC_ETH_LINK_PM1_IMASK_MGI_SHIFT        (14U)
/*! MGI - Magic packet detection indication event mask. */
#define NETC_ETH_LINK_PM1_IMASK_MGI(x)           (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM1_IMASK_MGI_SHIFT)) & NETC_ETH_LINK_PM1_IMASK_MGI_MASK)

#define NETC_ETH_LINK_PM1_IMASK_TX_CSD_MASK      (0x200000U)
#define NETC_ETH_LINK_PM1_IMASK_TX_CSD_SHIFT     (21U)
/*! TX_CSD - Tx Clock Stop Detection */
#define NETC_ETH_LINK_PM1_IMASK_TX_CSD(x)        (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM1_IMASK_TX_CSD_SHIFT)) & NETC_ETH_LINK_PM1_IMASK_TX_CSD_MASK)

#define NETC_ETH_LINK_PM1_IMASK_RX_CSD_MASK      (0x400000U)
#define NETC_ETH_LINK_PM1_IMASK_RX_CSD_SHIFT     (22U)
/*! RX_CSD - Rx Clock Stop Detection */
#define NETC_ETH_LINK_PM1_IMASK_RX_CSD(x)        (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM1_IMASK_RX_CSD_SHIFT)) & NETC_ETH_LINK_PM1_IMASK_RX_CSD_MASK)

#define NETC_ETH_LINK_PM1_IMASK_SPD_DUP_MASK     (0x800000U)
#define NETC_ETH_LINK_PM1_IMASK_SPD_DUP_SHIFT    (23U)
/*! SPD_DUP - Speed/Duplex change event mask. */
#define NETC_ETH_LINK_PM1_IMASK_SPD_DUP(x)       (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM1_IMASK_SPD_DUP_SHIFT)) & NETC_ETH_LINK_PM1_IMASK_SPD_DUP_MASK)

#define NETC_ETH_LINK_PM1_IMASK_MRG_SERR_MASK    (0x8000000U)
#define NETC_ETH_LINK_PM1_IMASK_MRG_SERR_SHIFT   (27U)
/*! MRG_SERR - MAC merge frame SMD error received event interrupt mask */
#define NETC_ETH_LINK_PM1_IMASK_MRG_SERR(x)      (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM1_IMASK_MRG_SERR_SHIFT)) & NETC_ETH_LINK_PM1_IMASK_MRG_SERR_MASK)

#define NETC_ETH_LINK_PM1_IMASK_MRG_AERR_MASK    (0x10000000U)
#define NETC_ETH_LINK_PM1_IMASK_MRG_AERR_SHIFT   (28U)
/*! MRG_AERR - MAC merge frame assembly error event interrupt mask */
#define NETC_ETH_LINK_PM1_IMASK_MRG_AERR(x)      (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM1_IMASK_MRG_AERR_SHIFT)) & NETC_ETH_LINK_PM1_IMASK_MRG_AERR_MASK)
/*! @} */

/*! @name PM1_PAUSE_QUANTA - Port MAC 1 Pause Quanta Register */
/*! @{ */

