Masmiseim36/nxpSDK/devices/MIMXRT1182/periph/PERI_NETC_ETH_LINK.h
/*! @name MAC_MERGE_MMFCRXR - Port MAC Merge Fragment Count RX Register */
/*! @{ */

#define NETC_ETH_LINK_MAC_MERGE_MMFCRXR_MMFCRX_MASK (0xFFFFFFFFU)
#define NETC_ETH_LINK_MAC_MERGE_MMFCRXR_MMFCRX_SHIFT (0U)
#define NETC_ETH_LINK_MAC_MERGE_MMFCRXR_MMFCRX(x) (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_MAC_MERGE_MMFCRXR_MMFCRX_SHIFT)) & NETC_ETH_LINK_MAC_MERGE_MMFCRXR_MMFCRX_MASK)
/*! @} */

/*! @name MAC_MERGE_MMFCTXR - Port MAC Merge Fragment Count TX Register */
/*! @{ */

#define NETC_ETH_LINK_MAC_MERGE_MMFCTXR_MMFCTX_MASK (0xFFFFFFFFU)
#define NETC_ETH_LINK_MAC_MERGE_MMFCTXR_MMFCTX_SHIFT (0U)
#define NETC_ETH_LINK_MAC_MERGE_MMFCTXR_MMFCTX(x) (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_MAC_MERGE_MMFCTXR_MMFCTX_SHIFT)) & NETC_ETH_LINK_MAC_MERGE_MMFCTXR_MMFCTX_MASK)
/*! @} */

/*! @name MAC_MERGE_MMHCR - Port MAC Merge Hold Count Register */
/*! @{ */

#define NETC_ETH_LINK_MAC_MERGE_MMHCR_MMHC_MASK  (0xFFFFFFFFU)
#define NETC_ETH_LINK_MAC_MERGE_MMHCR_MMHC_SHIFT (0U)
#define NETC_ETH_LINK_MAC_MERGE_MMHCR_MMHC(x)    (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_MAC_MERGE_MMHCR_MMHC_SHIFT)) & NETC_ETH_LINK_MAC_MERGE_MMHCR_MMHC_MASK)
/*! @} */

/*! @name PEMDIOCR - Port external MDIO configuration register */
/*! @{ */

#define NETC_ETH_LINK_PEMDIOCR_BSY2_MASK         (0x1U)
#define NETC_ETH_LINK_PEMDIOCR_BSY2_SHIFT        (0U)
/*! BSY2 - Busy 2 (same as bit 31)
 *  0b0..An MDIO transaction is not occurring; software may access other MDIO registers.
 *  0b1..An MDIO transaction is occurring.
 */
#define NETC_ETH_LINK_PEMDIOCR_BSY2(x)           (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PEMDIOCR_BSY2_SHIFT)) & NETC_ETH_LINK_PEMDIOCR_BSY2_MASK)

#define NETC_ETH_LINK_PEMDIOCR_MDIO_RD_ER_MASK   (0x2U)
#define NETC_ETH_LINK_PEMDIOCR_MDIO_RD_ER_SHIFT  (1U)
/*! MDIO_RD_ER
 *  0b0..No error on last MDIO transaction (read or write).
 *  0b1..An error was detected on the last MDIO transaction (read or write). Errors on internal MDIO accesses can
 *       be triggered by an access to an invalid device, or by a write to a shared on-die PHY device that has not
 *       been locked.
 */
#define NETC_ETH_LINK_PEMDIOCR_MDIO_RD_ER(x)     (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PEMDIOCR_MDIO_RD_ER_SHIFT)) & NETC_ETH_LINK_PEMDIOCR_MDIO_RD_ER_MASK)

#define NETC_ETH_LINK_PEMDIOCR_MDIO_HOLD_MASK    (0x1CU)
#define NETC_ETH_LINK_PEMDIOCR_MDIO_HOLD_SHIFT   (2U)
/*! MDIO_HOLD - MDIO Hold Time
 *  0b000..1 NETC cycle
 *  0b001..3 NETC cycles
 *  0b010..5 NETC cycles (default - recommended value)
 *  0b011..7 NETC cycles
 *  0b100..9 NETC cycles
 *  0b101..11 NETC cycles
 *  0b110..13 NETC cycles
 *  0b111..15 NETC cycles
 */
#define NETC_ETH_LINK_PEMDIOCR_MDIO_HOLD(x)      (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PEMDIOCR_MDIO_HOLD_SHIFT)) & NETC_ETH_LINK_PEMDIOCR_MDIO_HOLD_MASK)

#define NETC_ETH_LINK_PEMDIOCR_PRE_DIS_MASK      (0x20U)
#define NETC_ETH_LINK_PEMDIOCR_PRE_DIS_SHIFT     (5U)
/*! PRE_DIS - MDIO Preamble Disable
 *  0b0..Generation of MDIO preamble is enabled (default operation).
 *  0b1..Generation of MDIO preamble is disabled.
 */
#define NETC_ETH_LINK_PEMDIOCR_PRE_DIS(x)        (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PEMDIOCR_PRE_DIS_SHIFT)) & NETC_ETH_LINK_PEMDIOCR_PRE_DIS_MASK)

#define NETC_ETH_LINK_PEMDIOCR_ENC45_MASK        (0x40U)
#define NETC_ETH_LINK_PEMDIOCR_ENC45_SHIFT       (6U)
/*! ENC45 - Enable Clause 45 Support
 *  0b0..Clause 22 transactions are used.
 *  0b1..Clause 45 transactions are used.
 */
#define NETC_ETH_LINK_PEMDIOCR_ENC45(x)          (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PEMDIOCR_ENC45_SHIFT)) & NETC_ETH_LINK_PEMDIOCR_ENC45_MASK)

#define NETC_ETH_LINK_PEMDIOCR_MDIO_CLK_DIV_MASK (0xFF80U)
#define NETC_ETH_LINK_PEMDIOCR_MDIO_CLK_DIV_SHIFT (7U)
/*! MDIO_CLK_DIV - MDIO Clock Divisor */
#define NETC_ETH_LINK_PEMDIOCR_MDIO_CLK_DIV(x)   (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PEMDIOCR_MDIO_CLK_DIV_SHIFT)) & NETC_ETH_LINK_PEMDIOCR_MDIO_CLK_DIV_MASK)

#define NETC_ETH_LINK_PEMDIOCR_WHOAMI_MASK       (0x70000U)
#define NETC_ETH_LINK_PEMDIOCR_WHOAMI_SHIFT      (16U)
/*! WHOAMI - Returns the link ID */
#define NETC_ETH_LINK_PEMDIOCR_WHOAMI(x)         (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PEMDIOCR_WHOAMI_SHIFT)) & NETC_ETH_LINK_PEMDIOCR_WHOAMI_MASK)

#define NETC_ETH_LINK_PEMDIOCR_EHOLD_MASK        (0x400000U)
#define NETC_ETH_LINK_PEMDIOCR_EHOLD_SHIFT       (22U)
/*! EHOLD - Extended HOLD
 *  0b0..Normal operation, MDIO hold time is as specified in PEMDIOCR[MDIO_HOLD].
 *  0b1..Extended operation
 */
#define NETC_ETH_LINK_PEMDIOCR_EHOLD(x)          (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PEMDIOCR_EHOLD_SHIFT)) & NETC_ETH_LINK_PEMDIOCR_EHOLD_MASK)

#define NETC_ETH_LINK_PEMDIOCR_NEG_MASK          (0x800000U)
#define NETC_ETH_LINK_PEMDIOCR_NEG_SHIFT         (23U)
/*! NEG
 *  0b0..normal operation - positive edge
 *  0b1..MDIO is driven by master on MDC negative edge (default for external MDIOs)
 */
#define NETC_ETH_LINK_PEMDIOCR_NEG(x)            (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PEMDIOCR_NEG_SHIFT)) & NETC_ETH_LINK_PEMDIOCR_NEG_MASK)

#define NETC_ETH_LINK_PEMDIOCR_ADDR_ERR_MASK     (0x10000000U)
#define NETC_ETH_LINK_PEMDIOCR_ADDR_ERR_SHIFT    (28U)
/*! ADDR_ERR - Address Error
 *  0b0..Normal
 *  0b1..Error. An access control violation has occurred. The request address used does not match the MDIO PHY's
 *       address (clause 22) or MDIO port address (clause 45) assigned.
 */
#define NETC_ETH_LINK_PEMDIOCR_ADDR_ERR(x)       (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PEMDIOCR_ADDR_ERR_SHIFT)) & NETC_ETH_LINK_PEMDIOCR_ADDR_ERR_MASK)

#define NETC_ETH_LINK_PEMDIOCR_CIM_MASK          (0x20000000U)
#define NETC_ETH_LINK_PEMDIOCR_CIM_SHIFT         (29U)
/*! CIM
 *  0b0..Masked
 *  0b1..Enabled
 */
#define NETC_ETH_LINK_PEMDIOCR_CIM(x)            (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PEMDIOCR_CIM_SHIFT)) & NETC_ETH_LINK_PEMDIOCR_CIM_MASK)

#define NETC_ETH_LINK_PEMDIOCR_CMP_MASK          (0x40000000U)
#define NETC_ETH_LINK_PEMDIOCR_CMP_SHIFT         (30U)
/*! CMP - MDIO Command Completion
 *  0b0..An MDIO command completion did not occur.
 *  0b1..An MDIO command completion occurred.
 */
#define NETC_ETH_LINK_PEMDIOCR_CMP(x)            (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PEMDIOCR_CMP_SHIFT)) & NETC_ETH_LINK_PEMDIOCR_CMP_MASK)

#define NETC_ETH_LINK_PEMDIOCR_BSY1_MASK         (0x80000000U)
#define NETC_ETH_LINK_PEMDIOCR_BSY1_SHIFT        (31U)
/*! BSY1 - Busy 1
 *  0b0..An MDIO transaction is not occurring; software may access other MDIO registers.
 *  0b1..An MDIO transaction is occurring.
 */
#define NETC_ETH_LINK_PEMDIOCR_BSY1(x)           (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PEMDIOCR_BSY1_SHIFT)) & NETC_ETH_LINK_PEMDIOCR_BSY1_MASK)
/*! @} */

